In [1]:
#Import Dependencies
import pandas as pd
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import os
import csv
from datetime import datetime as dt
import datetime

In [2]:
#Read in Data from CSV
drug_data_csv = "Resources/drug_deaths.csv"
income_data_csv = "Resources/per_capita_personal_income.csv"
drug_data = pd.read_csv(drug_data_csv)
income_data = pd.read_csv(income_data_csv)
#drug_data.head()
income_data.head()

,GeoFips,GeoName,2012:Q1,2012:Q2,2012:Q3,2012:Q4,2013:Q1,2013:Q2,2013:Q3,2013:Q4,...,2016:Q4,2017:Q1,2017:Q2,2017:Q3,2017:Q4,2018:Q1,2018:Q2,2018:Q3,2018:Q4,2022:Q1
0,0,United States,13782978.7,13937105.4,13907136.3,14386163.6,14010895.7,14150636.3,14240498.3,14354881.7,...,16310112.9,16550511.4,16736270.1,16925356.4,17167974.1,17383520.8,17573877.4,17795581.2,17971656.6,21237207.4

In [3]:
#Desired Data
new_drug_data = drug_data[['ID','Date', 'Age', 'ResidenceState', 'COD', 'Heroin', 'Cocaine', 'Fentanyl', 'Oxycodone','Oxymorphone', 'Ethanol','Hydrocodone', 'Benzodiazepine', 'Methadone','Amphet', 'Tramad']].copy()
#new_drug_data.head()

new_income_data = income_data.iloc[:, [2, 3, 4, 5, 6, 7, 8, 9, 10, 11 ,12 ,13, 14, 15, 16,17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27,28,29]]
new_income_data.head()

,2012:Q1,2012:Q2,2012:Q3,2012:Q4,2013:Q1,2013:Q2,2013:Q3,2013:Q4,2014:Q1,2014:Q2,...,2016:Q3,2016:Q4,2017:Q1,2017:Q2,2017:Q3,2017:Q4,2018:Q1,2018:Q2,2018:Q3,2018:Q4
0,13782978.7,13937105.4,13907136.3,14386163.6,14010895.7,14150636.3,14240498.3,14354881.7,14616124.9,14868196.5,...,16148669,16310112.9,16550511.4,16736270.1,16925356.4,17167974.1,17383520.8,17573877.4,17795581.2,17971656.6

Data Cleaning: Drug Overdose Data

In [4]:
#Extract only year from Date Column
new_drug_data['Date'] = pd.to_datetime(new_drug_data['Date'])
new_drug_data['Date'] = pd.DatetimeIndex(new_drug_data['Date']).year

In [5]:
#Extract only year from Date Column
new_drug_data['Date'] = new_drug_data['Date'].fillna(0)
new_drug_data['Date'] = new_drug_data['Date'].astype(int)
new_drug_data = new_drug_data.set_index('Date')
new_drug_data.head()

,ID,Age,ResidenceState,COD,Heroin,Cocaine,Fentanyl,Oxycodone,Oxymorphone,Ethanol,Hydrocodone,Benzodiazepine,Methadone,Amphet,Tramad
Date,,,,,,,,,,,,,,,
2014,14-0273,NaN,NaN,"Acute fent, hydrocod, benzodiazepine",0,0,1,0,0,0,1,1,0,0,0
2013,13-0102,48.0,NaN,Cocaine Intoxication,0,1,0,0,0,0,0,0,0,0,0
2016,16-0165,30.0,CT,Acute Heroin and Cocaine Intoxication,1,1,0,0,0,0,0,0,0,0,0
2016,16-0208,23.0,NY,Acute Fentanyl and Morphine Intoxication,1,0,1,0,0,0,0,0,0,0,0
2013,13-0052,22.0,NaN,Fentanyl Intoxication,0,0,1,0,0,0,0,0,0,0,0

In [6]:
#Edit columns not int
new_drug_data["Fentanyl"].unique()
new_drug_data["Fentanyl"] = new_drug_data.apply(lambda row: int(row["Fentanyl"][:1]), axis=1)

In [7]:
#Combine data to be per year (2012 to 2018)
drug_overdose_temp = new_drug_data.groupby(by='Date').agg({'Fentanyl': 'sum',
                            'Heroin': 'sum',
                            'Cocaine': 'sum',
                            'Oxycodone': 'sum',
                            'Oxymorphone': 'sum',
                            'Ethanol' : 'sum',
                            'Hydrocodone' : 'sum',
                            'Benzodiazepine': 'sum',
                            'Methadone': 'sum',
                            'Amphet' : 'sum',
                            'Tramad' : 'sum'}).reset_index()

In [8]:
drug_overdose = drug_overdose_temp.drop(drug_overdose_temp.index[0])
drug_overdose

,Date,Fentanyl,Heroin,Cocaine,Oxycodone,Oxymorphone,Ethanol,Hydrocodone,Benzodiazepine,Methadone,Amphet,Tramad
1,2012,14,174,105,70,30,61,15,49,33,7,8
2,2013,37,257,147,74,16,83,19,78,47,4,7
3,2014,75,325,127,101,29,126,15,157,51,13,15
4,2015,188,416,174,95,6,176,20,221,72,20,16
5,2016,482,494,275,110,7,255,20,242,84,19,17
6,2017,676,474,347,95,8,290,15,330,99,40,28
7,2018,760,389,345,62,12,256,14,266,88,56,39

Data Cleaning: Personal Income Per Capita

In [9]:
#Concat Income Data
income_2012 = pd.concat([new_income_data['2012:Q1'], new_income_data['2012:Q2'],new_income_data['2012:Q3'],new_income_data['2012:Q4']],                  
                      ignore_index = True,
                      sort = False)

income_2013 = pd.concat([new_income_data['2013:Q1'], new_income_data['2013:Q2'],new_income_data['2013:Q3'],new_income_data['2013:Q4']],                  
                      ignore_index = True,
                      sort = False)

income_2014 = pd.concat([new_income_data['2014:Q1'], new_income_data['2014:Q2'],new_income_data['2014:Q3'],new_income_data['2014:Q4']],                  
                      ignore_index = True,
                      sort = False)

income_2015 = pd.concat([new_income_data['2015:Q1'], new_income_data['2015:Q2'],new_income_data['2015:Q3'],new_income_data['2015:Q4']],                  
                      ignore_index = True,
                      sort = False)

income_2016 = pd.concat([new_income_data['2016:Q1'], new_income_data['2016:Q2'],new_income_data['2016:Q3'],new_income_data['2016:Q4']],                  
                      ignore_index = True,
                      sort = False)

income_2017 = pd.concat([new_income_data['2017:Q1'], new_income_data['2017:Q2'],new_income_data['2017:Q3'],new_income_data['2017:Q4']],                  
                      ignore_index = True,
                      sort = False)

income_2018 = pd.concat([new_income_data['2018:Q1'], new_income_data['2018:Q2'],new_income_data['2018:Q3'],new_income_data['2018:Q4']],                  
                      ignore_index = True,
                      sort = False)

In [10]:
#Average income per year
average_2012 = income_2012.mean()
average_2013 = income_2013.mean()
average_2014 = income_2014.mean()
average_2015 = income_2015.mean()
average_2016 = income_2016.mean()
average_2017 = income_2017.mean()
average_2018 = income_2018.mean()

In [11]:
#Create new DF
yearly_income_USA = pd.DataFrame([{"Date": 2012,"Income":average_2012},
                                  {"Date": 2013,"Income":average_2013},
                                  {"Date": 2014,"Income":average_2014},
                                  {"Date": 2015,"Income":average_2015},
                                  {"Date": 2016,"Income":average_2016},
                                  {"Date": 2017,"Income":average_2017},
                                  {"Date": 2018,"Income":average_2018}])

yearly_income_USA

   Date        Income
0  2012  1.400335e+07
1  2013  1.418923e+07
2  2014  1.496953e+07
3  2015  1.568123e+07
4  2016  1.609271e+07
5  2017  1.684503e+07
6  2018  1.768116e+07

In [12]:
#Write clean data to csv
yearly_income_USA.to_csv('Clean Data/yearly_income_USA.csv',index=False)
drug_overdose.to_csv('Clean Data/drug_overdose.csv', index=False)

Connect to Local Database & Insert Cleaned Data to DB

In [13]:
#Import Dependencies
from sqlalchemy import create_engine
from sqlalchemy.orm import sessionmaker
from sqlalchemy_utils import database_exists, create_database
from config import postgresql as settings

In [14]:
def get_engine(protocol, username, password, host, port, db_name):
    url = f"{protocol}://{username}:{password}@{host}:{port}/{db_name}"
    if not database_exists(url):
        create_database(url)
    engine = create_engine(url, echo=False)
    return engine

In [15]:
#engine
engine = get_engine(settings['protocol'],
                    settings['username'],
                    settings['password'],
                    settings['host'],
                    settings['port'],
                    settings['db_name'])

In [16]:
engine.url

postgresql://postgres:***@localhost:5433/drug_income_db

In [17]:
#Read in clean data
drug_overdose_clean = pd.read_csv('Clean Data/drug_overdose.csv')
yearly_income_usa_clean = pd.read_csv('Clean Data/yearly_income_USA.csv')

In [18]:
#SQL convert from csv
drug_overdose_clean.to_sql(name='drug_data', con=engine, if_exists='append', index=False)
yearly_income_usa_clean.to_sql(name='income', con=engine, if_exists='append', index=False)

7

In [19]:
#Read SQL-Drugs
pd.read_sql_query('select * from drug_data', con=engine).head()

,Date,Fentanyl,Heroin,Cocaine,Oxycodone,Oxymorphone,Ethanol,Hydrocodone,Benzodiazepine,Methadone,Amphet,Tramad
0,2012,14,174,105,70,30,61,15,49,33,7,8
1,2013,37,257,147,74,16,83,19,78,47,4,7
2,2014,75,325,127,101,29,126,15,157,51,13,15
3,2015,188,416,174,95,6,176,20,221,72,20,16
4,2016,482,494,275,110,7,255,20,242,84,19,17

In [20]:
#Read SQL-Income
pd.read_sql_query('select * from income', con=engine).head()

   Date        Income
0  2012  1.400335e+07
1  2013  1.418923e+07
2  2014  1.496953e+07
3  2015  1.568123e+07
4  2016  1.609271e+07

In [21]:
engine.table_names()

C:\Users\COOPERKK\AppData\Local\Temp\ipykernel_20592\4162273999.py:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['drug_data', 'income']

Queries

In [22]:
#Join Drug Overdose Deaths with USE Yearly Income
pd.read_sql_query('select income."Date", income."Income", drug_data."Fentanyl", drug_data."Cocaine", \
            drug_data."Heroin", drug_data."Oxycodone", drug_data."Oxymorphone", drug_data."Ethanol", \
            drug_data."Hydrocodone", drug_data."Benzodiazepine",drug_data."Methadone", drug_data."Amphet", \
            drug_data."Tramad" from drug_data INNER JOIN income ON drug_data."Date" = income."Date"', con=engine)

,Date,Income,Fentanyl,Cocaine,Heroin,Oxycodone,Oxymorphone,Ethanol,Hydrocodone,Benzodiazepine,Methadone,Amphet,Tramad
0,2012,1.400335e+07,14,105,174,70,30,61,15,49,33,7,8
1,2013,1.418923e+07,37,147,257,74,16,83,19,78,47,4,7
2,2014,1.496953e+07,75,127,325,101,29,126,15,157,51,13,15
3,2015,1.568123e+07,188,174,416,95,6,176,20,221,72,20,16
4,2016,1.609271e+07,482,275,494,110,7,255,20,242,84,19,17
5,2017,1.684503e+07,676,347,474,95,8,290,15,330,99,40,28
6,2018,1.768116e+07,760,345,389,62,12,256,14,266,88,56,39

In [23]:
#Query- Max Deaths in 2018 with Associated Drug
pd.read_sql_query('select max(drug_data."Fentanyl") as Max_Fentanyl_Deaths , max(drug_data."Heroin") as Max_Heroin_Deaths, max(drug_data."Cocaine") as Max_Cocaine_Deaths, \
                  max(drug_data."Oxycodone") as Max_Oxycodone_Deaths, max(drug_data."Oxymorphone") as Max_Oxymorphone_Deaths, max(drug_data."Ethanol") as Max_Ethanol_Deaths, \
                  max(drug_data."Hydrocodone") as Max_Hydrocodone_Deaths, max(drug_data."Benzodiazepine") as Max_Benzodiazepine_Deaths, max(drug_data."Methadone") as Max_Methadone_Deaths, \
                  max(drug_data."Amphet") as Max_Amphet_Deaths,max(drug_data."Tramad") as Max_Tramad_Deaths, max(drug_data."Date") as Max_Date from drug_data', con=engine)

,max_fentanyl_deaths,max_heroin_deaths,max_cocaine_deaths,max_oxycodone_deaths,max_oxymorphone_deaths,max_ethanol_deaths,max_hydrocodone_deaths,max_benzodiazepine_deaths,max_methadone_deaths,max_amphet_deaths,max_tramad_deaths,max_date
0,760,494,347,110,30,290,20,330,99,56,39,2018

In [24]:
#Query- Min Deaths in 2012 with Associated Drugs
pd.read_sql_query('select min(drug_data."Fentanyl") as Min_Fentanyl_Deaths, min(drug_data."Heroin") as Min_Heroin_Deaths, min(drug_data."Cocaine") as Min_Cocaine_Deaths, \
                  min(drug_data."Oxycodone") as Min_Oxycodone_Deaths, min(drug_data."Oxymorphone") as Min_Oxymorphone_Deaths, min(drug_data."Ethanol") as Min_Oxymorphone_Deaths, \
                  min(drug_data."Hydrocodone") as Min_Hydrocodone_Deaths, min(drug_data."Benzodiazepine") as Min_Benzodiazepine_Deaths,min(drug_data."Methadone") as Min_Methadone_Deaths, \
                  min(drug_data."Amphet") as Min_Amphet_Deaths,min(drug_data."Tramad") as Min_Tramad_Deaths, min(drug_data."Date") as Min_Date from drug_data', con=engine)

,min_fentanyl_deaths,min_heroin_deaths,min_cocaine_deaths,min_oxycodone_deaths,min_oxymorphone_deaths,min_oxymorphone_deaths,min_hydrocodone_deaths,min_benzodiazepine_deaths,min_methadone_deaths,min_amphet_deaths,min_tramad_deaths,min_date
0,14,174,105,62,6,61,14,49,33,4,7,2012

In [32]:
#Query- Fentanyl vs. Heroin, 2 leading drugs casuing overdoses, comparision
pd.read_sql_query('select drug_data."Fentanyl", drug_data."Heroin", \
                  drug_data."Date" from drug_data where drug_data."Fentanyl" > 100  \
            and drug_data."Heroin" > 100', con=engine)

   Fentanyl  Heroin  Date
0       188     416  2015
1       482     494  2016
2       676     474  2017
3       760     389  2018

In [33]:
#Query- Fentanyl vs. Heroin, 2 leading drugs casuing overdoses, comparision
pd.read_sql_query('select drug_data."Fentanyl", drug_data."Heroin", \
                  drug_data."Date" from drug_data where drug_data."Fentanyl" < 100 \
            and drug_data."Heroin" < 100', con=engine)

Empty DataFrame
Columns: [Fentanyl, Heroin, Date]
Index: []

In [36]:
#close session
session.close()